; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	image0 - mode
	infrared1 - mode
	GroundStation1 - direction
	GroundStation11 - direction
	GroundStation8 - direction
	Star12 - direction
	GroundStation4 - direction
	Star0 - direction
	GroundStation6 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	GroundStation10 - direction
	Star3 - direction
	GroundStation9 - direction
	GroundStation7 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
	Planet16 - direction
	Star17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 Star12)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 GroundStation10)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation8)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 GroundStation10)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 GroundStation9)
	(calibration_target instrument3 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation10)
)
(:goal (and
	(have_image Star13 infrared1)
	(have_image Star14 image0)
	(have_image Planet15 infrared1)
	(have_image Planet16 infrared1)
	(have_image Star17 image0)
	(have_image Star18 infrared1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (calibrate satellite0 instrument0 groundstation8)
   added: (calibrated instrument0)
   goals met: 0 of 6
3. (turn_to satellite0 star13 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 star13)
   goals met: 0 of 6
4. (take_image satellite0 star13 instrument0 infrared1)
   added: (have_image star13 infrared1)
   goals met: 1 of 6
5. (turn_to satellite0 planet16 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 planet16)
   goals met: 1 of 6
6. (take_image satellite0 planet16 instrument0 infrared1)
   added: (have_image planet16 infrared1)
   goals met: 2 of 6
7. (turn_to satellite0 planet15 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet15)
   goals met: 2 of 6
8. (take_image satellite0 planet15 instrument0 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 3 of 6
9. (turn_to satellite0 star14 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star14)
   goals met: 3 of 6
10. (take_image satellite0 star14 instrument0 image0)
   added: (have_image star14 image0)
   goals met: 4 of 6
11. (turn_to satellite0 star17 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star17)
   goals met: 4 of 6
12. (take_image satellite0 star17 instrument0 image0)
   added: (have_image star17 image0)
   goals met: 5 of 6
13. (turn_to satellite0 star18 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star18)
   goals met: 5 of 6
14. (take_image satellite0 star18 instrument0 infrared1)
   added: (have_image star18 infrared1)
   goals met: 6 of 6
